InformationRegisters/ИсключенияКонтроляОстатковВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИсключенияКонтроляОстатковВРознице</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОграниченийСкидокПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыОграниченийСкидокПоНоменклатуре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКатегориям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦеновымГруппам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСегменту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ИсключенияКонтроляОстатковВРознице/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ПроцедураОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСегментыНоменклатуры") Тогда
		ВариантПоСегментам = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту;
		Элемент = Элементы.ВариантИсключенийКонтроляОстатковВРознице.СписокВыбора.НайтиПоЗначению(ВариантПоСегментам);
		Если Элемент <> Неопределено Тогда
			Элементы.ВариантИсключенийКонтроляОстатковВРознице.СписокВыбора.Удалить(Элемент);
		КонецЕсли;
	КонецЕсли;
	
	ВариантИсключенийКонтроляОстатковВРознице = Константы.ВариантИсключенийКонтроляОстатковВРознице.Получить();
	
	Если Не ЗначениеЗаполнено(ВариантИсключенийКонтроляОстатковВРознице) Тогда
		ВариантИсключенийКонтроляОстатковВРознице = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре;
		СохранитьВариантИсключений();
	КонецЕсли;
	
	ВариантИсключенийКонтроляОстатковВРозницеДоИзменения = ВариантИсключенийКонтроляОстатковВРознице;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементымиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедураОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВариантИсключенийКонтроляОстатковВРозницеПриИзменении(Элемент)
	
	Если ЕстьНастройкиИсключений() Тогда
		Оповещение = Новый ОписаниеОповещения("ВариантИсключенийКонтроляОстатковВРозницеПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Список исключений будет очищен. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет,
			НСтр("ru = 'Изменение варианта исключений'"));
	Иначе
		СохранитьВариантИсключений();
		ВариантИсключенийКонтроляОстатковВРозницеДоИзменения = ВариантИсключенийКонтроляОстатковВРознице;
		УправлениеЭлементымиФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьНастройкиИсключений()
	
	ЕстьНастройки = РегистрыСведений.ИсключенияКонтроляОстатковВРознице.ЕстьНастройкиИсключений();
	
	Возврат ЕстьНастройки;
	
КонецФункции

&НаКлиенте
Процедура ВариантИсключенийКонтроляОстатковВРозницеПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВариантИсключенийКонтроляОстатковВРознице = ВариантИсключенийКонтроляОстатковВРозницеДоИзменения;
	Иначе
		ИзменитьВариантИсключенийНаСервере();
		УправлениеЭлементымиФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВариантИсключенийНаСервере()
	
	НаборЗаписей = РегистрыСведений.ИсключенияКонтроляОстатковВРознице.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
	СохранитьВариантИсключений();
	ВариантИсключенийКонтроляОстатковВРозницеДоИзменения = ВариантИсключенийКонтроляОстатковВРознице;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВариантИсключений()
	
	Константы.ВариантИсключенийКонтроляОстатковВРознице.Установить(ВариантИсключенийКонтроляОстатковВРознице);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементымиФормы()
	
	Если ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Номенклатура'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ИначеЕсли ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Категория'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры"));
	ИначеЕсли ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Сегмент'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры"));
	ИначеЕсли ВариантИсключенийКонтроляОстатковВРознице = ПредопределенноеЗначение("Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "Заголовок", НСтр("ru = 'Ценовая группа'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Номенклатура", "ОграничениеТипа", Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
